# GetParameters Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..GetParameters Method
RebarShapeDefinition Class See Also
---
Return the Ids of the shared parameters in the Definition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public IList<ElementId> GetParameters()
```

Visual Basic
---
```text
Public Function GetParameters As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetParameters()
```

# ### Return Value
List of parameters as ElementIds.
# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace